# mac = {"macos": "ventura", "memory": 8, "color": "black", "size": "13 inch"}
# # print(mac["macos"])
# for i in mac:
#     print(mac[i])
#

# Задание 1
#
# Напишите скрипт, который создаёт текстовый файл и записывает в него 10000 случайных действительных чисел. Создайте
# ещё один скрипт, который читает числа из файла и выводит на экран их сумму.

